src/CF/Catalogs/АссортиментДляРабочегоМестаКассира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>АссортиментДляРабочегоМестаКассира</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияСОпределенногоСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияОтОпределеннойОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализоватьСИспользованиеОпределенногоВидаЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализоватьСПоступлениеДенегВОпределенноеХранилище</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаКнопкиКрасный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаКнопкиЗеленый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаКнопкиСиний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаКнопкиКрасный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаКнопкиЗеленый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаКнопкиСиний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРазмеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/АссортиментДляРабочегоМестаКассира/Ext/ObjectModule.bsl
//sza140606-0132  
Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления Тогда
		
		Если НЕ ЭтоГруппа 
			И Модифицированность() Тогда
			
			Если ЗначениеЗаполнено(Родитель) Тогда
				Если ЗначениеЗаполнено(Родитель.Подразделение)
					И (не ЗначениеЗаполнено(Подразделение) или Подразделение <> Родитель.Подразделение) Тогда
					
					Подразделение = Родитель.Подразделение;	
				КонецЕсли;
				Если ЗначениеЗаполнено(Родитель.РеализацияОтОпределеннойОрганизации)
					И (не ЗначениеЗаполнено(РеализацияОтОпределеннойОрганизации) или РеализацияОтОпределеннойОрганизации <> Родитель.РеализацияОтОпределеннойОрганизации) Тогда
					
					РеализацияОтОпределеннойОрганизации = Родитель.РеализацияОтОпределеннойОрганизации;	
				КонецЕсли;
				Если ЗначениеЗаполнено(Родитель.РеализацияСОпределенногоСклада)
					И (не ЗначениеЗаполнено(РеализацияСОпределенногоСклада) или РеализацияСОпределенногоСклада <> Родитель.РеализацияСОпределенногоСклада) Тогда
					
					РеализацияСОпределенногоСклада = Родитель.РеализацияСОпределенногоСклада;	
				КонецЕсли;
				Если ЗначениеЗаполнено(Родитель.РеализоватьСИспользованиеОпределенногоВидаЦен)
					И (не ЗначениеЗаполнено(РеализоватьСИспользованиеОпределенногоВидаЦен) или РеализоватьСИспользованиеОпределенногоВидаЦен <> Родитель.РеализоватьСИспользованиеОпределенногоВидаЦен) Тогда
					
					РеализоватьСИспользованиеОпределенногоВидаЦен = Родитель.РеализоватьСИспользованиеОпределенногоВидаЦен;	
				КонецЕсли;
				Если ЗначениеЗаполнено(Родитель.РеализоватьСПоступлениеДенегВОпределенноеХранилище)
					И (не ЗначениеЗаполнено(РеализоватьСПоступлениеДенегВОпределенноеХранилище) или РеализоватьСПоступлениеДенегВОпределенноеХранилище <> Родитель.РеализоватьСПоступлениеДенегВОпределенноеХранилище) Тогда
					
					РеализоватьСПоступлениеДенегВОпределенноеХранилище = Родитель.РеализоватьСПоступлениеДенегВОпределенноеХранилище;	
				КонецЕсли;
			КонецЕсли;
			
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНаименование(Отказ, "АссортиментДляРабочегоМестаКассира", Наименование, Ссылка, "Подразделение", Подразделение);
			
		ИначеЕсли Модифицированность() Тогда
			
			Если НЕ Отказ 
				И ЗначениеЗаполнено(Ссылка) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	АссортиментДляРабочегоМестаКассира.Ссылка
				|ИЗ Справочник.АссортиментДляРабочегоМестаКассира КАК АссортиментДляРабочегоМестаКассира
				|ГДЕ АссортиментДляРабочегоМестаКассира.Родитель = &Родитель";
				
				Запрос.УстановитьПараметр("Родитель", Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				Если НЕ РезультатЗапроса.Пустой() Тогда
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ОбъектАссортимента = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
						НеМенять = ИСТИНА;
						Если НЕ ОбъектАссортимента.Подразделение = Подразделение Тогда
							ОбъектАссортимента.Подразделение = Подразделение;
							НеМенять = ЛОЖЬ;
						КонецЕсли;
						Если ЗначениеЗаполнено(РеализацияОтОпределеннойОрганизации)
							И НЕ ОбъектАссортимента.РеализацияОтОпределеннойОрганизации = РеализацияОтОпределеннойОрганизации Тогда
							
							ОбъектАссортимента.РеализацияОтОпределеннойОрганизации = РеализацияОтОпределеннойОрганизации;
							НеМенять = ЛОЖЬ;
						КонецЕсли;
						Если ЗначениеЗаполнено(РеализацияСОпределенногоСклада)
							И НЕ ОбъектАссортимента.РеализацияСОпределенногоСклада = РеализацияСОпределенногоСклада Тогда
							
							ОбъектАссортимента.РеализацияСОпределенногоСклада = РеализацияСОпределенногоСклада;
							НеМенять = ЛОЖЬ;
						КонецЕсли;
						Если ЗначениеЗаполнено(РеализоватьСИспользованиеОпределенногоВидаЦен)
							И НЕ ОбъектАссортимента.РеализоватьСИспользованиеОпределенногоВидаЦен = РеализоватьСИспользованиеОпределенногоВидаЦен Тогда
							
							ОбъектАссортимента.РеализоватьСИспользованиеОпределенногоВидаЦен = РеализоватьСИспользованиеОпределенногоВидаЦен;
							НеМенять = ЛОЖЬ;
						КонецЕсли;
						Если ЗначениеЗаполнено(РеализоватьСПоступлениеДенегВОпределенноеХранилище)
							И НЕ ОбъектАссортимента.РеализоватьСПоступлениеДенегВОпределенноеХранилище = РеализоватьСПоступлениеДенегВОпределенноеХранилище Тогда
							
							ОбъектАссортимента.РеализоватьСПоступлениеДенегВОпределенноеХранилище = РеализоватьСПоступлениеДенегВОпределенноеХранилище;
							НеМенять = ЛОЖЬ;
						КонецЕсли;
						Если НЕ НеМенять Тогда
							ОбъектАссортимента.Записать();
						КонецЕсли;
						
					КонецЦикла;                	               	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Комментарий = "";
	Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	
КонецПроцедуры
